app/views/recipes/_form.html.erb

SELECT "ingredients".* FROM "ingredients"
---
  <div id="ingredients-container">
    <% @recipe.recipe_ingredients.each do |recipe_ingredient| %>

SELECT "ingredients".* FROM "ingredients"
---
            <%= ri.label :ingredient_id, "Ingredient", class: "form-label d-inline-block me-2" %>
            <%= ri.select :ingredient_id, Ingredient.all.collect { |ing| [ing.ingr_name, ing.id] },
                { include_blank: true }, class: "form-control d-inline-block" %>