app/controllers/home_controller.rb

  def index
    @recipes = Recipe.includes(:ingredients).take(5)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "recipes".* FROM "recipes" LIMIT ?  [["LIMIT", 5]]

  def urecipes
    @recipes = Recipe.includes(:ingredients).where(user_id: session[:user_id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 13], ["id", 2], ["id", 6], ["id", 11], ["id", 14], ["id", 19]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 15]]